NextFOAM-2501/tutorials/multiphase/interFoam/laminar/vofToLagrangian/eulerianInjection/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          1e-4;

writeControl    adjustable;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxAlphaCo      1;

maxDeltaT       1;

functions
{
    extractEulerianParticles1
    {
        // Mandatory entries
        type            extractEulerianParticles;
        libs            (fieldFunctionObjects);
        faceZone        collector;
        alpha           alpha.water;

        // Optional entries
        alphaThreshold  0.1;
        nLocations      20;
        U               U;
        rho             rho;
        phi             phi;
        //minDiameter     1e-30;
        //maxDiameter     1e30;

        // Optional (inherited) entries
        writePrecision   6;
        writeToFile      true;
        useUserTime      false;

        region          region0;
        enabled         true;
        log             true;
        timeStart       0;
        timeEnd         1000;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   -1;
    }
}


// ************************************************************************* //
